package ru.a365apps.pritci;

import java.util.ArrayList;
import java.util.List;


public class PritcaExpert {
    List<String> getPritci(String nomerpritci) {
        List<String> pritci = new ArrayList<String>();
        if( nomerpritci.equals("В чем секрет успеха?")){
            pritci.add("Жил один человек. И была у него особенность: ему яблоки падали прямо в руки. Он проходил мимо яблони, вытягивал руку — и обязательно падало яблоко." +
                    " Все удивлялись. И, конечно же, жаждали узнать, как это получается. А человек говорил: «Я умею хотеть. Я хочу, чтобы яблоко упало, и оно падает».\n" +
                    "\n" +
                    "Люди тоже хотели, но к ним яблоки в руки не падали.\n" +
                    "— Вы, значит, правильно хотеть не умеете, — отвечал им человек, но потом решил научить других.\n" +
                    "«Вот как хочу я, — сказал человек, достал веревки, пружины, кнопки, шурупы. — Я хочу, чтобы яблоко упало, и делаю для этого все»." +
                    " Человек стал объяснять о каком-то устройстве, которое надо крепить к яблоку, и проходить потом мимо яблока в точное время. Нажимать на пружину и все такое.\n" +
                    "\n" +
                    "— Это нечестно, — сказали люди.\n" +
                    "— Отчего же? Я хочу, и мое желание исполняется");
        }
        else if (nomerpritci.equals("Когда начинать новое дело")){
            pritci.add("Ученик спросил Учителя:\n" +
                    "— Учитель, существует ли день, наиболее благоприятный для того, чтобы начинать новое дело?\n" +
                    "— День? — удивился Учитель, а потом хитро посмотрел на учеников и добавил: — Да, конечно. Этот день — среда.\n" +
                    "\n" +
                    "Ученики схватились за тетради и начали записывать. Только один сидел и смотрел на Учителя. «А ты почему не записываешь?» — спросил Учитель.\n" +
                    "\n" +
                    "— Потому что я знаю, что вы скажете дальше, — ответил ученик. — Это не только среда, но и вторник, пятница, суббота, понедельник, четверг и воскресенье.\n" +
                    "— Ты прав, — улыбнулся Учитель. — Только я хотел назвать сначала пятницу, а потом вторник.\n" +
                    "Ученики зашумели, радуясь тому, что их товарищ сказал почти все правильно. А потом один из них спросил: «Учитель, именно такая последовательность?»" +
                    " Учитель внимательно посмотрел на ученика, который дал почти правильный ответ, и сделал ему знак рукой: «Ответь!»\n" +
                    "\n" +
                    "— Только один день, — сказал тот. — Этот день — сегодня.");
        }
        else if (nomerpritci.equals("Как проверить любовь на искренненость")){
            pritci.add("Король объявил, что ищет мужа для своей дочери. В назначенный день сотни женихов собрались во дворце. Каждый хотел доказать, что будет любить принцессу вечно. " +
                    "Девушка посмотрела на разодетых юношей и задумалась. Потом она позвала своего Учителя и долго беседовала с ним." +
                    " «Я не буду сегодня разговаривать с женихами», — объявила принцесса и снова пошла к Учителю.\n" +
                    "\n" +
                    "Дом Учителя стоял возле дороги. Когда мимо проехал первый жених, знатный рыцарь на коне, он увидел у дороги нищенку с корзиной цветов. " +
                    "Увидев рыцаря, та попросила: «Купите букетик, юноша». «Прочь с дороги, нищенка!» — крикнул рыцарь и ускакал. Так поступили все юноши, которые спешили в этот день во дворец." +
                    " На следующий день грустная принцесса принимала женихов. " +
                    "Сказав пару слов, она тут же отсылала их. То же повторилось и на второй день, и на третий.\n" +
                    "\n" +
                    "«Дочка, почему ты всех прогоняешь?» — встревоженно спросила королева. «Они не способны видеть красоту, мама», — ответила принцесса. Прошел месяц. Новые женихи собрались во дворце." +
                    " Не было только принцессы и одного юноши. Они появились вместе, и принцесса объявила, что нашла своего суженого. Потом она рассказала королеве:\n" +
                    "\n" +
                    "— Мой учитель сказал мне: «Любовь того проживет до конца жизни, кто полюбит тебя в лохмотьях». Каждый день я переодевалась в старую одежду и ждала женихов возле дороги. " +
                    "Только этот юноша остановился и купил у меня букет. Он сказал мне, что я прекрасна.\n");
        }
        else if (nomerpritci.equals("Как противостоять злу, которое меня окружает")){
            pritci.add("Человек купил большой и красивый дом с садом. Рядом жил завистливый сосед, который постоянно пытался испортить ему настроение: то мусор под ворота подбросит, то еще какую гадость натворит.\n" +
                    "\n" +
                    "Однажды человек проснулся в хорошем настроении, вышел на крыльцо и увидел ведро с помоями. Он взял ведро, вымыл его до блеска, насобирал туда самых спелых яблок и пошел к соседу. " +
                    "Сосед, услышав стук, подумал: «Наконец-то я его достал!», открыл дверь, а человек протянул ему ведро с яблоками и сказал:\n" +
                    "\n" +
                    "— Кто чем богат, тот тем и делится!");
        }
        else if (nomerpritci.equals("В чем смысл жизни?")){
            pritci.add("Профессор философии, стоя перед своей аудиторией, взял пятилитровую стеклянную банку и наполнил ее камнями. В конце спросил студентов, полна ли банка. " +
                    "Ответили: да, полна.\n" +
                    "\n" +
                    "Тогда он открыл банку горошка и высыпал его в большую банку, немного потряс ее. Естественно, горошек занял свободное место между камнями. " +
                    "Еще раз профессор спросил студентов, полна ли банка. Ответили: да, полна.\n" +
                    "\n" +
                    "Тогда он взял коробку, наполненную песком, и насыпал его в банку. Естественно, песок занял полностью существующее свободное место и все закрыл." +
                    " Еще раз профессор спросил студентов, полна ли банка. Ответили: да, и на этот раз однозначно полна.\n" +
                    "\n" +
                    "Потом профессор сказал:\n" +
                    "\n" +
                    "«А сейчас я хочу, чтобы вы поняли, что банка — это ваша жизнь. " +
                    "Камни — это важнейшие вещи вашей жизни: семья, здоровье, друзья, свои дети — все то, что необходимо, чтобы ваша жизнь все-таки оставалась полной даже в случае, если остальное потеряется. " +
                    "Горошек — это вещи, которые лично для вас стали важными: работа, дом, автомобиль. Песок — это все остальное, мелочи. " +
                    "Если сначала наполнить банку песком, не останется места, где могли бы разместиться горошек и камни. " +
                    "И так же в вашей жизни: если тратить все время и всю энергию на мелочи, не остается места для важнейших вещей. " +
                    "Занимайтесь тем, что вам приносит счастье: играйте с вашими детьми, уделяйте время супругам, встречайтесь с друзьями." +
                    " Всегда будет еще время, чтобы поработать, заняться уборкой дома, починить и помыть автомобиль." +
                    " Занимайтесь прежде всего камнями, то есть самыми важными вещами в жизни; определите ваши приоритеты: остальное — только песок».");
        }
        else if (nomerpritci.equals("Где искать счастье")){
            pritci.add("Однажды карманник увидел человека, который купил большой бриллиант. Он последовал за ним, даже купил билет на тот же поезд, в который сел человек с бриллиантом. " +
                    "Карманник обыскал купе, когда человек уснул, но безуспешно.\n" +
                    "\n" +
                    "Когда поезд прибыл и человек, купивший бриллиант, оказался на платформе, карманник подошел к нему:\n" +
                    "\n" +
                    "— Простите, господин, — сказал он. — Я профессиональный вор. Я испробовал все и больше вас не побеспокою, но позвольте спросить: куда вы спрятали бриллиант?\n" +
                    "\n" +
                    "Человек ответил:\n" +
                    "\n" +
                    "— Я видел, что ты следишь за мной, и долго не мог придумать, куда же спрятать бриллиант, чтобы ты не нашел его. В конце концов я спрятал его в твоем кармане.\n" +
                    "\n" +
                    "Бриллиант, который ты ищешь, всегда находится рядом с тобой — ближе, чем твое дыхание. Но ты обыскиваешь карманы Будды. Вытряхни все из карманов своего ума." +
                    " Ищи там, где нет расстояния и ничего не надо делать.");
        }
        else if (nomerpritci.equals("Как научиться радоваться каждому дню")){
            pritci.add("Один Мастер всю жизнь был счастливым, улыбка никогда не сходила с его лица. Даже умирая, он смеялся. Его ученики сидели вокруг и один спросил:\n" +
                    "\n" +
                    "— Всю жизнь вы смеетесь, и сейчас мы решились спросить, как вам это удается? И вот сейчас, в последние минуты… Что здесь смешного?\n" +
                    "\n" +
                    "Старый Мастер ответил:\n" +
                    "\n" +
                    "— Много лет назад я пришел к моему Мастеру молодым человеком, но уже глубоко страдающим. Мастеру же было семьдесят, а он улыбался и смеялся просто так, без всякой видимой причины. " +
                    "Я спросил его: «Как вам это удается?» И он ответил: «Внутри я свободен в своем выборе. Просто это — мой выбор." +
                    " Каждое утро, когда я открываю глаза, я спрашиваю себя, что выбрать сегодня — блаженство или страдание? И так случается, что я выбираю блаженство, ведь это так естественно».\n");
        }
        return pritci;
    }

}
